{"weightsManifest": [{"paths": ["group1-shard1of2", "group1-shard2of2"], "weights": [{"shape": [5, 128, 256], "name": "convolution_1/kernel", "dtype": "float32"}, {"shape": [256], "name": "convolution_1/bias", "dtype": "float32"}, {"shape": [5, 256, 256], "name": "convolution_2/kernel", "dtype": "float32"}, {"shape": [256], "name": "convolution_2/bias", "dtype": "float32"}, {"shape": [5, 256, 256], "name": "convolution_3/kernel", "dtype": "float32"}, {"shape": [256], "name": "convolution_3/bias", "dtype": "float32"}, {"shape": [256, 1024], "name": "lstm/kernel", "dtype": "float32"}, {"shape": [256, 1024], "name": "lstm/recurrent_kernel", "dtype": "float32"}, {"shape": [1024], "name": "lstm/bias", "dtype": "float32"}, {"shape": [256, 10], "name": "time_distributed/kernel", "dtype": "float32"}, {"shape": [10], "name": "time_distributed/bias", "dtype": "float32"}]}], "modelTopology": {"backend": "tensorflow", "keras_version": "2.1.6-tf", "model_config": {"config": {"name": "model", "input_layers": [["input", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input", "config": {"name": "input", "batch_input_shape": [null, null, 128], "sparse": false, "dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input", 0, 0, {}]]], "name": "convolution_1", "config": {"kernel_constraint": null, "trainable": true, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [5], "filters": 256, "name": "convolution_1", "use_bias": true, "activation": "linear", "strides": [1], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}}, "class_name": "Conv1D"}, {"inbound_nodes": [[["convolution_1", 0, 0, {}]]], "name": "activation", "config": {"trainable": true, "name": "activation", "activation": "relu", "dtype": "float32"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation", 0, 0, {}]]], "name": "max_pooling1d", "config": {"trainable": true, "padding": "valid", "name": "max_pooling1d", "strides": [2], "pool_size": [2], "dtype": "float32"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["max_pooling1d", 0, 0, {}]]], "name": "convolution_2", "config": {"kernel_constraint": null, "trainable": true, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [5], "filters": 256, "name": "convolution_2", "use_bias": true, "activation": "linear", "strides": [1], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}}, "class_name": "Conv1D"}, {"inbound_nodes": [[["convolution_2", 0, 0, {}]]], "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "relu", "dtype": "float32"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "max_pooling1d_1", "config": {"trainable": true, "padding": "valid", "name": "max_pooling1d_1", "strides": [2], "pool_size": [2], "dtype": "float32"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]], "name": "convolution_3", "config": {"kernel_constraint": null, "trainable": true, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [5], "filters": 256, "name": "convolution_3", "use_bias": true, "activation": "linear", "strides": [1], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}}, "class_name": "Conv1D"}, {"inbound_nodes": [[["convolution_3", 0, 0, {}]]], "name": "activation_2", "config": {"trainable": true, "name": "activation_2", "activation": "relu", "dtype": "float32"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "max_pooling1d_2", "config": {"trainable": true, "padding": "valid", "name": "max_pooling1d_2", "strides": [2], "pool_size": [2], "dtype": "float32"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]], "name": "dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout", "noise_shape": null, "seed": null, "dtype": "float32"}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "lstm", "config": {"kernel_constraint": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "return_state": false, "recurrent_dropout": 0.0, "recurrent_constraint": null, "recurrent_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dropout": 0.0, "name": "lstm", "bias_constraint": null, "activation": "tanh", "activity_regularizer": null, "kernel_regularizer": null, "stateful": false, "dtype": "float32", "unit_forget_bias": true, "units": 256, "bias_regularizer": null, "go_backwards": false, "recurrent_regularizer": null, "use_bias": true, "implementation": 1, "unroll": false, "return_sequences": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"inbound_nodes": [[["lstm", 0, 0, {}]]], "name": "dropout_1", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null, "dtype": "float32"}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "time_distributed", "config": {"trainable": true, "layer": {"config": {"kernel_constraint": null, "trainable": true, "units": 10, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "name": "dense", "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "dtype": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, "name": "time_distributed", "dtype": "float32"}, "class_name": "TimeDistributed"}, {"inbound_nodes": [[["time_distributed", 0, 0, {}]]], "name": "output_realtime", "config": {"trainable": true, "name": "output_realtime", "activation": "softmax", "dtype": "float32"}, "class_name": "Activation"}], "output_layers": [["output_realtime", 0, 0]]}, "class_name": "Model"}, "training_config": {"metrics": [], "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"config": {"decay": 0.0, "rho": 0.8999999761581421, "lr": 9.999999747378752e-06, "epsilon": 1e-07}, "class_name": "RMSprop"}, "loss": "categorical_crossentropy"}}}
