backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, null, 128]
      dtype: float32
      name: input
      sparse: false
    inbound_nodes: []
    name: input
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      dtype: float32
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5]
      name: convolution_1
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input
        - 0
        - 0
        - {}
    name: convolution_1
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation, trainable: true}
    inbound_nodes:
    - - - convolution_1
        - 0
        - 0
        - {}
    name: activation
  - class_name: MaxPooling1D
    config:
      dtype: float32
      name: max_pooling1d
      padding: valid
      pool_size: !!python/tuple [2]
      strides: !!python/tuple [2]
      trainable: true
    inbound_nodes:
    - - - activation
        - 0
        - 0
        - {}
    name: max_pooling1d
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      dtype: float32
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5]
      name: convolution_2
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling1d
        - 0
        - 0
        - {}
    name: convolution_2
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_1, trainable: true}
    inbound_nodes:
    - - - convolution_2
        - 0
        - 0
        - {}
    name: activation_1
  - class_name: MaxPooling1D
    config:
      dtype: float32
      name: max_pooling1d_1
      padding: valid
      pool_size: !!python/tuple [2]
      strides: !!python/tuple [2]
      trainable: true
    inbound_nodes:
    - - - activation_1
        - 0
        - 0
        - {}
    name: max_pooling1d_1
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      dtype: float32
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5]
      name: convolution_3
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling1d_1
        - 0
        - 0
        - {}
    name: convolution_3
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_2, trainable: true}
    inbound_nodes:
    - - - convolution_3
        - 0
        - 0
        - {}
    name: activation_2
  - class_name: MaxPooling1D
    config:
      dtype: float32
      name: max_pooling1d_2
      padding: valid
      pool_size: !!python/tuple [2]
      strides: !!python/tuple [2]
      trainable: true
    inbound_nodes:
    - - - activation_2
        - 0
        - 0
        - {}
    name: max_pooling1d_2
  - class_name: Dropout
    config: {dtype: float32, name: dropout, noise_shape: null, rate: 0.5, seed: null,
      trainable: true}
    inbound_nodes:
    - - - max_pooling1d_2
        - 0
        - 0
        - {}
    name: dropout
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dropout: 0.0
      dtype: float32
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      name: lstm
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {dtype: float32, gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: true
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 256
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - dropout
        - 0
        - 0
        - {}
    name: lstm
  - class_name: Dropout
    config: {dtype: float32, name: dropout_1, noise_shape: null, rate: 0.5, seed: null,
      trainable: true}
    inbound_nodes:
    - - - lstm
        - 0
        - 0
        - {}
    name: dropout_1
  - class_name: TimeDistributed
    config:
      dtype: float32
      layer:
        class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {dtype: float32}
          bias_regularizer: null
          dtype: null
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
              seed: null}
          kernel_regularizer: null
          name: dense
          trainable: true
          units: 10
          use_bias: true
      name: time_distributed
      trainable: true
    inbound_nodes:
    - - - dropout_1
        - 0
        - 0
        - {}
    name: time_distributed
  - class_name: Activation
    config: {activation: softmax, dtype: float32, name: output_realtime, trainable: true}
    inbound_nodes:
    - - - time_distributed
        - 0
        - 0
        - {}
    name: output_realtime
  - class_name: Lambda
    config:
      arguments: {}
      dtype: float32
      function: !!python/tuple ['4wEAAAAAAAAAAQAAAAQAAABTAAAAcxMAAAB0AABqAQB8AABkAQBkAgCDAQFTKQNO2gRheGlz6QEA

          AAApAtoBS9oEbWVhbikB2gF4qQByBgAAAPoOdHJhaW5fbW9kZWwucHnaCDxsYW1iZGE+OAAAAHMA

          AAAA

          ', null, null]
      function_type: lambda
      name: output_merged
      output_shape: !!python/tuple ['4wEAAAAAAAAAAQAAAAQAAABTAAAAcxkAAAB8AABkAQAZZgEAfAAAZAIAZAAAhQIAGRdTKQNO6QAA

          AADpAgAAAKkAKQHaBXNoYXBlcgMAAAByAwAAAPoOdHJhaW5fbW9kZWwucHnaCDxsYW1iZGE+OQAA

          AHMAAAAA

          ', null, null]
      output_shape_type: lambda
      trainable: true
    inbound_nodes:
    - - - output_realtime
        - 0
        - 0
        - {}
    name: output_merged
  name: model
  output_layers:
  - [output_merged, 0, 0]
keras_version: 2.1.6-tf
